## Лабораторная работа. Доступ к сетевым устройствам по протоколу SSH

#### Топология

![alt-текст](https://github.com/AtomTob/OtusNetwork/blob/main/HomeLabs/Lab05/files/Screenshot_1.png?raw=true "Схема сети")

#### Таблица адресации

|Устройство	|Интерфейс	|IP-адрес	|Маска подсети	|Шлюз по умолчанию|
| ------------- |:------------------:|------------- |------------- |-------------|
|R1	|G0/0/1	|192.168.1.1	|255.255.255.0	|—|
|S1	|VLAN 1	|192.168.1.11	|255.255.255.0	|192.168.1.1|
|PC-A	|NIC	|192.168.1.3	|255.255.255.0	|192.168.1.1|

##

### Задачи
#### Часть 1. Настройка основных параметров устройств
##### Шаг 1. Создайте сеть согласно топологии

![alt-текст](https://github.com/AtomTob/OtusNetwork/blob/main/HomeLabs/Lab05/files/Jpg01.png?raw=true "Схема сети")

##
##### Шаг 2. Выполните инициализацию и перезагрузку маршрутизатора и коммутатора.

На маршрутизаторе на схеме первоначальная конфигурация.

##
##### Шаг 3. Настройте маршрутизатор.
> a.	Подключитесь к маршрутизатору с помощью консоли и активируйте привилегированный режим EXEC.

> b.	Войдите в режим конфигурации.

> c.	Отключите поиск DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введенные команды таким образом, как будто они являются именами узлов.

no ip domain-lookup

> d.	Назначьте **class** в качестве зашифрованного пароля привилегированного режима EXEC.

Router(config)#enable secret 0 class

> e.	Назначьте **cisco** в качестве пароля консоли и включите вход в систему по паролю.

Router(config)#line con 0<br>
Router(config-line)# password 7 0822455D0A16<br>
Router(config-line)# logging synchronous<br>
Router(config-line)# login<br>

> f.	Назначьте ciscoв качестве пароля VTY и включите вход в систему по паролю.

Router(config)#line vty 0 15<br>
Router(config-line)# password 7 0822455D0A16<br>
Router(config-line)# login<br>

> g.	Зашифруйте открытые пароли.

Все пароли вводились хешами, за исключением в привилегированный режим EXEC.<br>
Но при необходимости можно использовать команду Router(config)#service password-encryption.

> h.	Создайте баннер, который предупреждает о запрете несанкционированного доступа.

Router(config)#banner motd !!!!!!!!!!!!enter only for MA, no MAX or MAXIM!!!!!!

> i.	Настройте и активируйте на маршрутизаторе интерфейс G0/0/1, используя информацию, приведенную в таблице адресации.

Router(config)#int g0/1<br>
Router(config-if)#ip address 192.168.1.1 255.255.255.0<br>

> j.	Сохраните текущую конфигурацию в файл загрузочной конфигурации.

Router#wr<br>
Building configuration...<br>
[OK]

##
##### Шаг 4. Настройте компьютер PC-A.







